[
  {
    "company": "MobiFone Solutions",
    "url": "https://mobifonesolutions.vn",
    "role": "Technical Lead / System Architect",
    "period": "Jun 2025 — Present",
    "description": "Lead architect for national-scale Digital Government platforms at MobiFone Solutions, while also owning DevOps and system administration responsibilities across platform operations, reliability, and release delivery.",
    "highlights": [
      "Designed and governed architecture across many modules/software domains as the main architect",
      "Engineered the platform for 120M CCU readiness with high availability, scalability, and operational resilience",
      "Owned DevOps/SysAdmin execution: infrastructure operations, CI/CD workflows, production hardening, and incident response",
      "Ensured compliance with strict ISO/TCVN standards and security requirements throughout design and delivery",
      "Established fast CI/CD and continuous improvement loops with strong observability and release discipline"
    ],
    "technologies": [
      "TypeScript",
      "Node.js",
      "C#",
      ".NET",
      "Oracle",
      "Kafka",
      "OpenShift",
      "Prometheus",
      "Grafana"
    ]
  },
  {
    "company": "VinFast",
    "url": "https://vinfast.vn",
    "role": "Senior Software Engineer",
    "period": "May 2024 — Jun 2025",
    "description": "Worked at Vietnam's best-selling car brand as Senior Software Engineer, taking on both development and infrastructure roles. Built and operated high-load systems for Green Future (Vietnam's largest car rental service) and internal enterprise portals.",
    "highlights": [
      "Rebuilt Green Future's entire system from scratch in ~2 months with zero-downtime migration",
      "Designed and operated AWS infrastructure (EKS, EC2, RDS, Elasticache) with full CI/CD automation",
      "Implemented monitoring, alerting, and log aggregation for production reliability across services",
      "Managed Kubernetes clusters, rolling deployments, and auto-scaling for traffic spikes"
    ],
    "technologies": [
      "TypeScript",
      "Go",
      "NestJS",
      "Next.js",
      "AWS",
      "EKS",
      "Docker",
      "CI/CD",
      "MySQL",
      "Redis"
    ]
  },
  {
    "company": "EMDDI JSC",
    "url": "https://emddi.com",
    "role": "Full-stack Engineer → Backend Leader",
    "period": "Aug 2020 — May 2024",
    "description": "Core engineer at EMDDI, a ride-hailing platform powering Taxi Viet Union (200+ taxi companies, 100k+ vehicles). Led backend for GSM XanhSM — a Vingroup-backed ride-hailing app serving over 1 million trips daily across Taxi, E-scooter, and Delivery services.",
    "highlights": [
      "Led backend architecture for XanhSM: ~20 microservices, 1M TPM, P99 < 800ms, 99.99% uptime",
      "Operated high-load production systems on AWS EKS — managing deployments, scaling, and incident response",
      "Built CI/CD pipelines and automated testing, reducing deployment time and improving release confidence",
      "Designed cross-service communication via REST, message brokers, RPC, and event queues"
    ],
    "technologies": [
      "TypeScript",
      "Go",
      "NestJS",
      "Express",
      "Fastify",
      "Socket.io",
      "React",
      "AWS",
      "EKS",
      "Docker",
      "MySQL",
      "Redis"
    ]
  },
  {
    "company": "Foobla Vietnam (Merchize)",
    "url": "https://merchize.com",
    "role": "Full-stack Developer",
    "period": "Feb 2019 — Aug 2020",
    "description": "Contributed to nearly all aspects of Merchize, an online POD/Dropshipping platform. Built customer-facing shopping experiences and seller back-office tools, plus a specialized artwork-to-product conversion tool for print-on-demand workflows.",
    "highlights": [
      "Developed shopping cart experiences and seller management tools end-to-end",
      "Built artwork-to-printable-product conversion tool for streamlined POD workflow",
      "Worked across the full stack with React/Next.js frontend and Node.js backend"
    ],
    "technologies": ["TypeScript", "JavaScript", "React", "Next.js", "Node.js"]
  },
  {
    "company": "Admeta",
    "role": "Front-end Developer",
    "period": "Jun 2018 — Feb 2019",
    "description": "Built a frontend web application for managing marketing campaigns, enabling teams to create, schedule, and monitor campaigns across multiple channels. Also developed lightweight mini web campaigns as optimized HTML static pages.",
    "highlights": [
      "Built campaign management dashboard with React",
      "Developed performance-optimized static landing pages for marketing campaigns"
    ],
    "technologies": ["JavaScript", "React", "HTML/CSS"]
  }
]
